"""
Задача 1: Простая арифметика
 - cоздает две переменные a и b и присваивает им значения 5 и 10 соответственно.
 - cоздает переменную sum и присваивает ей сумму a и b.
 - выводит значение переменной sum.
"""

a = 5
b = 10
sum = a + b
print(sum)

"""
Задача 2: Обмен значений
 - cоздает две переменные x и y и присваивает им значения "apple" и "banana" соответственно.
 - меняет значения переменных x и y местами.
 - выводит значения переменных x и y.
"""

x = "apple"
y = "banana"
x, y = y, x
print(x, y)

"""
Задача 3: Типы данных
 - создает переменные a, b, c и присваивает им значения 10, 3.14 и "Python" соответственно.
 - выводит тип каждой переменной.
"""

a = 10
b = 3.14
c = "Python"
print(type(a))
print(type(b))
print(type(c))